# Group By

In [1]:
import pandas as pd

In [2]:
data = {'Name':['Asem', 'Omar', 'Mohamed', 'Ahmed', 'Islam', 'Hesham','Ayman'],
       'Company' :['Google','Meta','Google','Amazon','Amazon','Meta','Google'],
       'Salary':[4000,2000,3500,4200,3540,4300,2950]}

In [3]:
df = pd.DataFrame (data)

In [4]:
df

      Name Company  Salary
0     Asem  Google    4000
1     Omar    Meta    2000
2  Mohamed  Google    3500
3    Ahmed  Amazon    4200
4    Islam  Amazon    3540
5   Hesham    Meta    4300
6    Ayman  Google    2950

### Using `DataFrame.groupby()`

In [5]:
df.groupby('Company')

In [6]:
df.groupby('Company').mean()

              Salary
Company
Amazon   3870.000000
Google   3483.333333
Meta     3150.000000

In [7]:
bycomp = df.groupby('Company')

In [8]:
bycomp.std ()

              Salary
Company
Amazon    466.690476
Google    525.198375
Meta     1626.345597

In [9]:
df.groupby('Company').min()

           Name  Salary
Company
Amazon    Ahmed    3540
Google     Asem    2950
Meta     Hesham    2000

In [10]:
df.groupby('Company').max()

            Name  Salary
Company
Amazon     Islam    4200
Google   Mohamed    4000
Meta        Omar    4300

In [11]:
df.groupby('Company').count()

         Name  Salary
Company
Amazon      2       2
Google      3       3
Meta        2       2

In [12]:
df.groupby ('Company').describe ()

        Salary                                                            \
         count         mean          std     min     25%     50%     75%
Company
Amazon     2.0  3870.000000   466.690476  3540.0  3705.0  3870.0  4035.0
Google     3.0  3483.333333   525.198375  2950.0  3225.0  3500.0  3750.0
Meta       2.0  3150.000000  1626.345597  2000.0  2575.0  3150.0  3725.0


            max
Company
Amazon   4200.0
Google   4000.0
Meta     4300.0

In [13]:
df.groupby ('Company').describe ().transpose ()

Company            Amazon       Google         Meta
Salary count     2.000000     3.000000     2.000000
       mean   3870.000000  3483.333333  3150.000000
       std     466.690476   525.198375  1626.345597
       min    3540.000000  2950.000000  2000.000000
       25%    3705.000000  3225.000000  2575.000000
       50%    3870.000000  3500.000000  3150.000000
       75%    4035.000000  3750.000000  3725.000000
       max    4200.000000  4000.000000  4300.000000

In [14]:
df.groupby ('Company').describe ().transpose ()['Meta']

Salary  count       2.000000
        mean     3150.000000
        std      1626.345597
        min      2000.000000
        25%      2575.000000
        50%      3150.000000
        75%      3725.000000
        max      4300.000000
Name: Meta, dtype: float64